# caskroom/cask
tap 'caskroom/cask'
brew 'brew-cask'

cask 'avast'
cask 'firefox'
cask 'google-japanese-ime'
cask 'karabiner'
cask 'iterm2'
cask 'skype'
cask 'virtualbox'
cask 'vagrant'
cask 'vlc'
cask 'java'
cask 'slack'
cask 'kindle'
cask 'xquartz'
cask 'alfred'
cask 'nmap'
cask 'shiftit'
cask 'dropbox'
cask 'gimp'
cask 'terraform'
cask 'packer'
cask 'boot2docker'
cask 'macvim'

# caskroom/fonts
tap 'caskroom/fonts'

# caskroom/versions
tap 'caskroom/versions'

# homebrew/brewdler
tap 'homebrew/brewdler'

# homebrew/dupes
tap 'homebrew/dupes'

# homebrew/versions
tap 'homebrew/versions'

# others
tap 'motemen/ghq'
brew 'ghq', args: ['completions']
brew 'coreutils'
brew 'ctags'
brew 'fontconfig'
brew 'glib'
brew 'libxml2'
brew 'pcre'
brew 'openssl'
brew 'tree'
brew 'hub', args: ['HEAD']
brew 'peco'
brew 'tmux', args: ['HEAD']
brew 'w3m'
brew 'zsh'
brew 'git'
brew 'direnv'
brew 'rbenv'
brew 'ruby-build'
brew 'rbenv-binstubs'
brew 'rbenv-gem-rehash'
brew 'nkf'
brew 'go'
brew 'autoconf'
brew 'automake'
brew 'pkg-config'
brew 'reattach-to-user-namespace'
brew 'wget'
brew 'sha2'
brew 'cmake'
brew 'xz'
brew 'lua'
brew 'vim', args: ['with-lua', 'HEAD']
brew 'rsense'
brew 'pyenv'
brew 'plenv'
brew 'perl-build'
brew 'awscli'
brew 'docker'
brew 'jq'
tap 'kevwil/patches'
brew 'kevwil/patches/mutt', args: ['with-sidebar-patch', 'with-confirm-attachement-patch', 'with-trash-patch']
brew 'gpg'
brew 'msmtp'
brew 'getmail'
brew 'abook'
brew 'weechat', args: ['with-ruby', 'with-python', 'with-perl']
tap 'bfontaine/utils'
brew 'rfc'
brew 'mobile-shell'
brew 'ripmime'
brew 'extract_url'
brew 'xhyve'

# sanemat/ricty
tap 'sanemat/font'
brew 'ricty'
