# caskroom/cask
tap 'caskroom/cask'
brew 'brew-cask'

cask 'avast'
cask 'firefox'
cask 'google-japanese-ime'
cask 'karabiner'
cask 'iterm2'
cask 'skype'
cask 'virtualbox'
cask 'vagrant'
cask 'vlc'
cask 'java'
cask 'remote-desktop-connection'
cask 'slack'
cask 'kindle'
cask 'xquartz'

# caskroom/fonts
tap 'caskroom/fonts'

# caskroom/versions
tap 'caskroom/versions'

# homebrew/brewdler
tap 'homebrew/brewdler'

# homebrew/dupes
tap 'homebrew/dupes'

# homebrew/versions
tap 'homebrew/versions'

# others
tap 'motemen/ghq'
brew 'ghq'
brew 'coreutils'
brew 'ctags'
brew 'fontconfig'
brew 'glib'
brew 'libxml2'
brew 'pcre'
#brew 'nmap'
brew 'openssl'
brew 'tree'
brew 'hub', args: ['HEAD']
brew 'peco'
brew 'tmux', args: ['HEAD']
brew 'w3m'
brew 'zsh'
brew 'zsh-completions'
brew 'git'
brew 'direnv'
brew 'rbenv'
brew 'ruby-build'
brew 'rbenv-binstubs'
brew 'rbenv-gem-rehash'
brew 'nkf'
brew 'go'
brew 'autoconf'
brew 'automake'
brew 'pkg-config'
brew 'reattach-to-user-namespace'
brew 'wget'
brew 'sha2'

# sanemat/ricty
tap 'sanemat/font'
brew 'ricty'

